;*******************************************************************************************
;  FILE:   XComGameLoco	WOTCRustyAlchemist                                    
; 
;	File created by RustyDios	24/11/19	02:45
;	LAST UPDATED				08/01/21	10:00
;
;*******************************************************************************************

;**************************************
;	Changes to Base-Game Abilities 
;**************************************

; Change the Launch Grenade ability to use the dynamic ClassName tag rather than specifically referencing the Grenadier:
[LaunchGrenade X2AbilityTemplate]
LocFriendlyName="发射榴弹"
-LocLongDescription="榴弹兵使用榴弹发射器发射榴弹，而非通过投掷。这样榴弹可以飞得更远，装弹量也更大。"
+LocLongDescription="<Ability:ClassName/> 使用榴弹发射器发射榴弹，而非通过投掷。这样榴弹可以飞得更远，装弹量也更大。"
LocHelpText="对目标区域发射已装填的榴弹。"
-LocPromotionPopupText="<Bullet/>榴弹发射器发射的所有榴弹都会有更远的射程，包括非进攻型榴弹，如：烟雾榴弹。<br/><Bullet/>在特殊榴弹专用槽中可装备一个额外的榴弹。<br/><Bullet/>升级成更高级的榴弹发射器后，榴弹的射程将会更远。<br/>"
+LocPromotionPopupText="<Ability:ClassName/> 使用榴弹发射器发射榴弹，而非通过投掷。这样榴弹可以飞得更远，装弹量也更大。"

; Change the Fortress ability to use the dynamic ClassName tag (OPTC adds ALL the environmental immunity types)
[Fortress X2AbilityTemplate]
LocFriendlyName="要塞"
LocLongDescription="<Ability:ClassName/>对电，寒霜，火焰，毒药，酸以及爆炸伤害免疫。"
LocHelpText="<Ability:ClassName/>对，寒霜，火焰，毒药，酸以及爆炸伤害免疫。"
LocFlyOverText="要塞"
LocPromotionPopupText="<Bullet/>拥有要塞技能的<Ability:ClassName/>能够不受影响地穿过带电，爆炸，寒霜，火焰，有毒区域和腐蚀区域。<br/>"



;change field medic to also mention the alchemist
[FieldMedic X2AbilityTemplate]
LocFriendlyName="战地医疗"
LocLongDescription="装备的急救包有<Ability:FIELDMEDICBONUS/>额外充能。"
LocHelpText="装备的急救包有<Ability:FIELDMEDICBONUS/>额外充能。"
LocPromotionPopupText="<Bullet/>如果专家拥有医疗协议技能，小精灵能获得额外使用次数。<br/><Bullet>如果一个炼金术士拥有医疗喷雾技能，该技能也会获得额外次数."
;**************************************
; Alchemist Class Specific
;**************************************

[RustyAlchemist X2SoldierClassTemplate]
DisplayName = "炼金术士"
ClassSummary = "炼金术士喜欢混合普通的化学物质以产生广泛的扩散效果。\n狂暴术士是富有攻击性使用有毒混合物的大师。\n治愈大师是使用滋补混合物治疗各种痛苦的大师.\n欧米伽擅长使用各种化合罐,施与各种特效"
+AbilityTreeTitles = "狂暴术士"
+AbilityTreeTitles = "治愈大师"
+AbilityTreeTitles = "欧米伽"
+AbilityTreeTitles = "XCOM"

+RandomNickNames = "巴哈马"
+RandomNickNames = "通气管"
+RandomNickNames = "冷冻机"
+RandomNickNames = "龙"
+RandomNickNames = "龙骑兵"
+RandomNickNames = "药品"
+RandomNickNames = "除尘器"
+RandomNickNames = "埃拉贡"
+RandomNickNames = "埃罗尔"
+RandomNickNames = "呼气机"
+RandomNickNames = "法尔科。"
+RandomNickNames = "火焰器"
+RandomNickNames = "焰舌"
+RandomNickNames = "烤架"
+RandomNickNames = "搜索"
+RandomNickNames = "吸入器"
+RandomNickNames = "洛克希德"
+RandomNickNames = "米茨鲁蒂"
+RandomNickNames = "瘟疫医生"
+RandomNickNames = "净化器"
+RandomNickNames = "喘气"
+RandomNickNames = "烟火"
+RandomNickNames = "拉莫斯"
+RandomNickNames = "雷德利"
+RandomNickNames = "生锈的"
+RandomNickNames = "萨菲拉"
+RandomNickNames = "品味"
+RandomNickNames = "烟鬼"
+RandomNickNames = "喷雾器"
+RandomNickNames = "弹簧"
+RandomNickNames = "酷夏"
+RandomNickNames = "烤箱"
+RandomNickNames = "无牙"
+RandomNickNames = "暴君"
+RandomNickNames = "毒牙"
+RandomNickNames = "寒冬"

RankNames[0]="菜鸟"
RankNames[1]="点火器"
RankNames[2]="纵火狂"
RankNames[3]="火鸦"
RankNames[4]="烟火"
RankNames[5]="火鸟"
RankNames[6]="灰烬"
RankNames[7]="焚尽"
;RankNames[8]="---"

ShortNames[0]="菜."
ShortNames[1]="点火."
ShortNames[2]="纵火."
ShortNames[3]="日."
ShortNames[4]="烟."
ShortNames[5]="鸩."
ShortNames[6]="烬."
ShortNames[7]="焚."
;ShortNames[8]="---."

;*** Encyclopedia Entry ***
[RustyAlchemist X2EncyclopediaTemplate]
ListTitle = "炼金术士"
DescriptionTitle = "炼金术士"
DescriptionEntry = "炼金术士喜欢混合普通的化学物质以产生广泛的扩散效果。\n狂暴术士是富有攻击性使用有毒混合物的大师。\n治愈大师是使用滋补混合物治疗各种痛苦的大师.\n欧米伽擅长使用各种化合罐,施与各种特效."




;*** GTS Unlocks ***
[MZRoaringFlamesUnlock X2SoldierAbilityUnlockTemplate]
DisplayName = "炼金术士：咆哮的火焰"
Summary = "一种新的混合化学物质的方法使得炼金术士获得一种更具攻击性的液体，使他们更容易在反应射击中暴击."

[MZSearingMagnesiumUnlock X2SoldierAbilityUnlockTemplate]
DisplayName = "炼金术士：灼烧镁"
Summary = "一种新的混合化学物质的方法使得炼金术士获得一种更具攻击性的液体，使他们在暴击时造成额外的伤害."

;**************************************
;	Chemthrower Ability Alterations
;**************************************

[MZFumigate X2AbilityTemplate]
+LocPromotionPopupText="<Bullet/>喷洒清洁化学品，清除锥形目标的环境损害.<br/><Bullet/>可能会被反吹回来,作用于<Ability:ClassName/>.<br/><Bullet/>熏蒸消耗 <Ability:FUMIGATE_AMMO/> 弹药 并 <Ability:FUMIGATE_CONSUMEALL/> 回合结束.<br/><br/><Bullet/>如果 <Ability:ClassName/> 同时拥有 '团队精神的味道' 熏蒸,可移除神志不清,迷失方向,惊慌失措 (心神不宁,狂暴和筋疲力尽) 和昏迷等状态.<br/><Bullet>如果 <Ability:ClassName/> 同时拥有 '热能屏障' 熏蒸目标同时获得 <Ability:FUMIGATE_BULWARK/>% 机会偏移攻击."

[MZMedispray X2AbilityTemplate]
+LocPromotionPopupText="<Bullet/>喷射使人恢复的化学物质，在一个圆锥体内治疗目标.<br/><Bullet/>可能会被反吹回来,作用于<Ability:ClassName/>.有 <Ability:MEDISPRAY_CHARGES/> 充能在每次任务 并 <Ability:MEDISPRAY_CONSUMEALL/> 结束回合.<br/><Bullet/>每个携带的医疗包都会获得额外充能，同时也会受到战地医疗的影响.<br/><br/><Bullet/>如果 <Ability:ClassName/> 同时拥有 '团队精神的味道' 得到 <Ability:MEDISPRAY_CHARGES_SPIRIT/> 额外充能.<br/><Bullet>如果 <Ability:ClassName/> 同时拥有 '热能屏障' 受医疗喷雾影响的目标获得 <Ability:FUMIGATE_BULWARK/>% 几率偏转攻击, 但只有在单位确实受到治疗的情况下才能触发."


[MZSmellsLikeTeamSpirit X2AbilityTemplate]
LocLongDescription="<Bullet/>熏蒸喷雾可移除神志不清,迷失方向,惊慌失措 (心神不宁,狂暴和筋疲力尽) 和昏迷等状态。.<br/><Bullet/>医疗喷雾获得 <Ability:MEDISPRAY_CHARGES_SPIRIT/> 额外充能."
LocHelpText="<Bullet/>熏蒸喷雾可移除神志不清,迷失方向,惊慌失措 (心神不宁,狂暴和筋疲力尽) 和昏迷等状态。.<br/><Bullet/>医疗喷雾获得 <Ability:MEDISPRAY_CHARGES_SPIRIT/> 额外充能."
LocPromotionPopupText="<Bullet/>熏蒸喷雾可移除神志不清,迷失方向,惊慌失措 (心神不宁,狂暴和筋疲力尽) 和昏迷等状态。.<br/><Bullet/>医疗喷雾获得 <Ability:MEDISPRAY_CHARGES_SPIRIT/> 额外充能."

[MZMedicCanister X2WeaponTemplate]
FriendlyName="医疗罐"
FriendlyNamePlural="医疗罐"
BriefSummary="烟雾罐的升级版, 使其左右范围内的目标回复HP."
TacticalText="<Bullet/> 化合罐只能与化学喷射器一起装备使用.<br><Bullet/>允许<Ability:SMOKECANISTER_USES>使用熏蒸喷射的能力.<br><Bullet/>提供锥形区域拥有与烟雾弹相同的效果.<br><Bullet/>每回合恢复1HP,每经过1回合增加恢复1HP，持续3回合. <br><Bullet/>效果影响熏蒸喷雾及医疗喷雾.<br><Bullet/>如果学习了战地医生将+<Ability:MEDICCANISTER_USES>次数."
AbilityDescName="化合罐"
